cfg/InformationRegisters/КадровыйПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КадровыйПлан</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПлановыеЕжемесячныеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРуководительПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьРешение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/СведенияОРабочихМестах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОРабочихМестах</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыОрганизационнойСтруктурыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОрганизационнойСтруктурыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтруктуреЮридическихЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦентрамОтветственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНазваниеВакансииВСМИ</Name>
					<Comment>Название вакансии в средствах массовой информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/InformationRegisters/КадровыйПлан/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Перем мРежимНабораПерсонала;

// Процедура устанавливает доступность реквизитов формы в зависимости от значения переключателей
//
Процедура УстановитьДоступностьРеквизитовФормы()
	
	ЭлементыФормы.Требования.ТолькоПросмотр		= Не УточнитьОписаниеВакансии;
	ЭлементыФормы.Обязанности.ТолькоПросмотр	= Не УточнитьОписаниеВакансии;
	ЭлементыФормы.Условия.ТолькоПросмотр		= Не УточнитьОписаниеВакансии;
	
КонецПроцедуры // УстановитьДоступностьРеквизитовФормы()

Процедура ОбновитьОписаниеВакансии()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Должность",		Должность);
	
	Если мРежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		Запрос.УстановитьПараметр("ПодразделениеОрганизации",	ПодразделениеОрганизации);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.УточнитьОписаниеВакансии КАК УточнитьОписаниеВакансии,
		|	ВложенныйЗапрос.Требования,
		|	ВложенныйЗапрос.Обязанности,
		|	ВложенныйЗапрос.Условия
		|ИЗ
		|	(ВЫБРАТЬ
		|		Должности.Требования КАК Требования,
		|		Должности.Обязанности КАК Обязанности,
		|		Должности.Условия КАК Условия,
		|		ЛОЖЬ КАК УточнитьОписаниеВакансии
		|	ИЗ
		|		Справочник.Должности КАК Должности
		|	ГДЕ
		|		Должности.Ссылка = &Должность
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОРабочихМестах.Требования,
		|		СведенияОРабочихМестах.Обязанности,
		|		СведенияОРабочихМестах.Условия,
		|		ИСТИНА
		|	ИЗ
		|		РегистрСведений.СведенияОРабочихМестах КАК СведенияОРабочихМестах
		|	ГДЕ
		|		СведенияОРабочихМестах.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|		И СведенияОРабочихМестах.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|		И СведенияОРабочихМестах.Должность = &Должность) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	УточнитьОписаниеВакансии УБЫВ";
	Иначе
		Запрос.УстановитьПараметр("Подразделение",	Подразделение);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.УточнитьОписаниеВакансии КАК УточнитьОписаниеВакансии,
		|	ВложенныйЗапрос.Требования,
		|	ВложенныйЗапрос.Обязанности,
		|	ВложенныйЗапрос.Условия
		|ИЗ
		|	(ВЫБРАТЬ
		|		Должности.Требования КАК Требования,
		|		Должности.Обязанности КАК Обязанности,
		|		Должности.Условия КАК Условия,
		|		ЛОЖЬ КАК УточнитьОписаниеВакансии
		|	ИЗ
		|		Справочник.Должности КАК Должности
		|	ГДЕ
		|		Должности.Ссылка = &Должность
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОРабочихМестах.Требования,
		|		СведенияОРабочихМестах.Обязанности,
		|		СведенияОРабочихМестах.Условия,
		|		ИСТИНА
		|	ИЗ
		|		РегистрСведений.СведенияОРабочихМестах КАК СведенияОРабочихМестах
		|	ГДЕ
		|		СведенияОРабочихМестах.Подразделение = &Подразделение
		|		И СведенияОРабочихМестах.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|		И СведенияОРабочихМестах.Должность = &Должность) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	УточнитьОписаниеВакансии УБЫВ";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЕсли;
	
КонецПроцедуры // ОбновитьОписаниеВакансии()

Процедура ЗаписатьОписание()
	
	НаборЗаписей = РегистрыСведений.СведенияОРабочихМестах.СоздатьНаборЗаписей();
	Если мРежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		НаборЗаписей.Отбор.ПодразделениеОрганизации.Установить(ПодразделениеОрганизации);
	Иначе
		НаборЗаписей.Отбор.Подразделение.Установить(Подразделение);
	КонецЕсли;
	НаборЗаписей.Отбор.Должность.Установить(Должность);
	
	Если УточнитьОписаниеВакансии Тогда
		Запись = НаборЗаписей.Добавить();
		Если мРежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
			Запись.ПодразделениеОрганизации	= ПодразделениеОрганизации;
		Иначе
			Запись.Подразделение			= Подразделение;
		КонецЕсли;
		Запись.Должность	= Должность;
		
		Запись.Требования	= Требования;
		Запись.Обязанности	= Обязанности;
		Запись.Условия		= Условия;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	мРежимНабораПерсонала = Константы.РежимНабораПерсонала.Получить();
	
	Если мРежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		ЭлементыФормы.ПанельРежимНабораПерсонала.ТекущаяСтраница = ЭлементыФормы.ПанельРежимНабораПерсонала.Страницы.ПоСтруктуреЮридическихЛиц;
	Иначе
		ЭлементыФормы.ПанельРежимНабораПерсонала.ТекущаяСтраница = ЭлементыФормы.ПанельРежимНабораПерсонала.Страницы.ПоЦентрамОтветственности;
	КонецЕсли;
	
	ОбновитьОписаниеВакансии();
	
	УстановитьДоступностьРеквизитовФормы();
	
	ТекущийЭлемент = ЭлементыФормы.Требования;
	
КонецПроцедуры // ПриОткрытии()

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?';uk='Дані були змінені. Зберегти зміни?'");
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаписатьОписание();
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура ОсновныеДействияФормыЗаписатьИЗакрыть(Кнопка)
	
	ЗаписатьОписание();
	Закрыть();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	
	ЗаписатьОписание();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ДолжностьНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь
КонецПроцедуры

Процедура ПодразделениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь
КонецПроцедуры

Процедура ПодразделениеОрганизацииНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь
КонецПроцедуры

Процедура ИспользоватьОписаниеВакансииИзДолжностиПриИзменении(Элемент)
	
	УстановитьДоступностьРеквизитовФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
